src/InformationRegisters/ОценкаПользователей/ОценкаПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаПользователей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОбщаяОценка</name>
    <type>
      <types>EnumRef.ОценкаПользователей</types>
    </type>
  </resources>
  <resources>
    <name>СкоростьВыполненияОпераций</name>
    <type>
      <types>EnumRef.ОценкаПользователей</types>
    </type>
  </resources>
  <resources>
    <name>ОтсутствиеОшибок</name>
    <type>
      <types>EnumRef.ОценкаПользователей</types>
    </type>
  </resources>
  <resources>
    <name>Доступность</name>
    <type>
      <types>EnumRef.ОценкаПользователей</types>
    </type>
  </resources>
  <resources>
    <name>Функционал</name>
    <type>
      <types>EnumRef.ОценкаПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиЗамерПроизводительности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ВидыОбъектовКонтроля/ВидыОбъектовКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОбъектовКонтроля</name>
  <predefined>
    <items>
      <name>ИнформационнаяБаза</name>
      <description>Информационные базы</description>
    </items>
    <items>
      <name>КластерСерверов1С</name>
      <description>Кластеры серверов 1С:Предприятия</description>
    </items>
    <items>
      <name>РабочийСервер</name>
      <description>Рабочие серверы</description>
    </items>
    <items>
      <name>ЦентрКонтроляКачества</name>
      <description>Центры контроля качества</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/CommonModules/РасширяемыеПараметрыЯдра/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НазванияВнешнихФормНаФормеКонтрольнойПроцедуры(ВидКонтрольнойПроцедуры) Экспорт
	Формы = ВсеНазванияВнешнихФормНаФормеКонтрольнойПроцедуры();
	Если Формы.Свойство(ВидКонтрольнойПроцедуры.ИмяБизнесПроцесса) Тогда
		Возврат Формы[ВидКонтрольнойПроцедуры.ИмяБизнесПроцесса];
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
КонецФункции

// Определяет список внешних форм, которые требуется открывать из формы задачи
// для каждой контрольной процедуры
//
// Возвращаемое значение:
// Структура
//
Функция НазванияВнешнихФормДляВсехВидовПроцедур() Экспорт
	Результат = Новый Структура;
	
	//////////////////////
	// КонтрольПодключений
	
	Результат.Вставить("КонтрольПодключений", Новый Соответствие);
	
	//////////////////////
	// Сбор дампов
	
	Результат.Вставить("СборДампов", Новый Соответствие);
	
	//////////////////////
	// Контроль памяти
	Результат.Вставить("КонтрольПамяти", Новый Соответствие);
	
	//////////////////////
	// ВнешнийКонтрольЦКК
	
	Формы = Новый Соответствие;
	НеНайденыОтчеты = Новый Соответствие; 
    
    Формы.Вставить(
		Справочники.ТипыЗадачВнешнийКонтрольЦКК.ВнешнийКонтрольЦККНеНайденыОтчеты,
		НеНайденыОтчеты
	);
	
	Формы.Вставить(
		Справочники.ТипыЗадач.СозданиеИНастройкаКонтрольнойПроцедуры,
		НеНайденыОтчеты
	);
	
	Результат.Вставить("ВнешнийКонтрольЦКК", Формы);
	
	/////////////////////////////
	// КонтрольРегламентныхЗаданий
	
	Результат.Вставить("КонтрольРегламентныхЗаданий", Новый Соответствие);
	
	Возврат Результат;
КонецФункции

// Определяет список названий макетов для объектов контроля и видов
// объектов контроля
//
// Возвращаемое значение:
// Структура
//
Функция СписокМакетовРекомендацийВидыОбъектов(ЭтоВид = Истина) Экспорт
	Результат = Новый Соответствие;
	
	Результат.Вставить(
		Справочники.ВидыОбъектовКонтроля.РабочийСервер, 
		?(ЭтоВид, "РабочиеСерверы", "РабочийСервер") 
	);
	
	Результат.Вставить(
		Справочники.ВидыОбъектовКонтроля.ЦентрКонтроляКачества, 
		?(ЭтоВид, "ЦентрыКонтроляКачества", "ЦентрКонтроляКачества")
	);
	
	Результат.Вставить(
		Справочники.ВидыОбъектовКонтроля.ИнформационнаяБаза, 
		?(ЭтоВид, "ИнформационныеБазы", "ИнформационнаяБаза")
	);
	
	Результат.Вставить(
		Справочники.ВидыОбъектовКонтроля.КластерСерверов1С, 
		?(ЭтоВид, "КластерыСерверов1С", "КластерСерверов1С")
	);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет список внешних форм, которые требуется открывать из формы задачи
// для каждой контрольной процедуры
//
// Возвращаемое значение:
// Структура
//
Функция ВсеНазванияВнешнихФормНаФормеКонтрольнойПроцедуры() 
	
	Результат = Новый Структура;
	
	// Контроль устойчивости
	Формы = Новый Массив;
	Формы.Добавить(Новый Структура("Название, ПутьКФорме", "Анализ дампов", "ОбщаяФорма.АнализДампов",));
	Результат.Вставить("СборДампов", Формы);

	
	// Контроль производительности
	Формы = Новый Массив;
	Формы.Добавить(Новый Структура("Название, ПутьКФорме", "Замеры производительности", "ОбщаяФорма.ЗамерыПроизводительности",));
	Формы.Добавить(Новый Структура("Название, ПутьКФорме", "Оценка производительности", "Отчет.ОценкаПроизводительностиСКД.Форма.ФормаОтчета",));
	Результат.Вставить("КонтрольПроизводительности", Формы);
	
	// Контроль памяти
	Результат.Вставить("КонтрольПамяти", Новый Массив);
	
	// КонтрольЧислаИсключений
	Формы = Новый Массив;
	Формы.Добавить(Новый Структура("Название, ПутьКФорме", "Рейтинг исключений", "Обработка.КонтрольИсключенийПоТехнологическомуЖурналу.Форма"));
	Формы.Добавить(Новый Структура("Название, ПутьКФорме", "Рейтинг исключений (по последней строке)", "Обработка.КонтрольИсключенийПоТехнологическомуЖурналуГруппировкаПоПоследнейСтроке.Форма"));
	Формы.Добавить(Новый Структура("Название, ПутьКФорме", "Рейтинг ошибок блокировок", "Обработка.ОшибкиБлокировокПоТехнологическомуЖурналу.Форма"));
	Результат.Вставить("КонтрольЧислаИсключений", Формы);
	
	// АнализВызововКластера1С
	Формы = Новый Массив;
	Формы.Добавить(Новый Структура("Название, ПутьКФорме", "Анализ вызовов кластера 1С", "Обработка.АнализВызововКластера1С.Форма"));
	Результат.Вставить("АнализВызововКластера1С", Формы);
	
	// Оценка пользователей
	Формы = Новый Массив;
	Формы.Добавить(Новый Структура("Название, ПутьКФорме", "Оценки пользователей", "РегистрСведений.ОценкаПользователей.ФормаСписка"));
	Результат.Вставить("ОценкаПользователей", Формы);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
